**Question: 1**<br>
**175. Combine Two Tables**     
**Difficulty: Easy**

Table: Person

| Column Name | Type    |
|-------------|---------|
| PersonId    | int     |
| FirstName   | varchar |
| LastName    | varchar |

PersonId is the primary key column for this table.<br><br>
Table: Address<br>

| Column Name | Type    |
|-------------|---------|
| AddressId   | int     |
| PersonId    | int     |
| City        | varchar |
| State       | varchar |

AddressId is the primary key column for this table.<br>
<br>
Write a SQL query for a report that provides the following information for each person in the Person table, regardless if there is an address for each of those people:

FirstName, LastName, City, State

In [ ]:
Solution:

SELECT FirstName, LastName, City, State
FROM Person left outer join Address
on Person.PersonId = Address.PersonId

**Question: 2**<br>
**176. Second Highest Salary**     
**Difficulty: Easy**

Write a SQL query to get the second highest salary from the Employee table.


| Id | Salary |
|----|--------|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

For example, given the above Employee table, the query should return 200 as the second highest salary. If there is no second highest salary, then the query should return null.

| SecondHighestSalary |
|---------------------|
| 200                 |

In [ ]:
Solution:

SELECT DISTINCT Salary 
FROM Employee 
ORDER BY Salary DESC 
LIMIT 1 
OFFSET 1

**Question: 3**<br>
**181. Employees Earning More Than Their Managers**     
**Difficulty: Easy**

The Employee table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.


| Id | Name  | Salary | ManagerId |
|----|-------|--------|-----------|
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |

Given the Employee table, write a SQL query that finds out employees who earn more than their managers. For the above table, Joe is the only employee who earns more than his manager.


| Employee |
|----------|
| Joe      |

In [ ]:
Solution:

SELECT e.Name as Employee 
FROM Employee e
JOIN Employee m
ON e.ManagerId = m.Id
WHERE e.Salary > m.Salary

**Question: 4**<br>
**182. Duplicate Emails**     
**Difficulty: Easy**

Write a SQL query to find all duplicate emails in a table named Person.

| Id | Email   |
|----|---------|
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |

For example, your query should return the following for the above table:

| Email   |
|---------|
| a@b.com |

In [ ]:
Solution:

SELECT Email
FROM Person
GROUP BY Email
HAVING COUNT(Email) > 1;

**Question: 5**<br>
**183. Customers Who Never Order**<br>
**Difficulty: Easy**<br>

Suppose that a website contains two tables, the Customers table and the Orders table. Write a SQL query to find all customers who never order anything.

Table: Customers

| Id | Name  |
|----|-------|
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |

Table: Orders.

| Id | CustomerId |
|----|------------|
| 1  | 3          |
| 2  | 1          |

Using the above tables as example, return the following:

| Customers |
|-----------|
| Henry     |
| Max       |

In [ ]:
Solution:

SELECT Customers.Name as 'Customers'
FROM Customers
WHERE Customers.Id NOT IN
(
SELECT CustomerId 
FROM Orders
);

**Question: 6**<br>
**196. Delete Duplicate Emails**<br>
**Difficulty: Easy**<br>

Write a SQL query to delete all duplicate email entries in a table named Person, keeping only unique emails based on its smallest Id.

| Id | Email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |

Id is the primary key column for this table.
For example, after running your query, the above Person table should have the following rows:

| Id | Email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |

Note:

Your output is the whole Person table after executing your sql. Use delete statement.

In [ ]:
Solution:

DELETE p1 
FROM Person p1 JOIN Person p2
ON p1.Email = p2.Email
WHERE p1.id > p2.id

**Question: 7**<br>
**197. Rising Temperature**<br>
**Difficulty: Easy**<br>

Given a Weather table, write a SQL query to find all dates' Ids with higher temperature compared to its previous (yesterday's) dates.

| Id(INT) | RecordDate(DATE) | Temperature(INT) |
|---------|------------------|------------------|
|       1 |       2015-01-01 |               10 |
|       2 |       2015-01-02 |               25 |
|       3 |       2015-01-03 |               20 |
|       4 |       2015-01-04 |               30 |

For example, return the following Ids for the above Weather table:


| Id |
|----|
|  2 |
|  4 |

In [ ]:
Solution:

SELECT w1.id
FROM weather w1 INNER JOIN weather w2
ON w1.id <> w2.id
WHERE w1.Temperature > w2.Temperature AND w1.RecordDate = DATEADD(DAY,1,w2.RecordDate);